In [1]:
## Basic Package

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = [
    ["Rossi", 25, "Jakarta"],
    ["selvy", 18, "Bandung"],
    ["Rita", 22, "Malang"],
    ["Sony", 17, "Medan"]
]

In [5]:
df = pd.DataFrame(data, columns = ['Nama', 'Usia', 'Kota'], index = ['A', 'B', 'C', 'D'])
df

    Nama  Usia     Kota
A  Rossi    25  Jakarta
B  selvy    18  Bandung
C   Rita    22   Malang
D   Sony    17    Medan

In [6]:
## Mengakses kolom di dataframe
df['Nama']

A    Rossi
B    selvy
C     Rita
D     Sony
Name: Nama, dtype: object

In [7]:
df.Nama

A    Rossi
B    selvy
C     Rita
D     Sony
Name: Nama, dtype: object

In [8]:
## Mengakses kolom di dataframe
df[['Nama', 'Usia']]

    Nama  Usia
A  Rossi    25
B  selvy    18
C   Rita    22
D   Sony    17

In [9]:
## Mengakses kolom di dataframe
df['Nama']['B']

'selvy'

In [10]:
df.Nama.B

'selvy'

In [11]:
df

    Nama  Usia     Kota
A  Rossi    25  Jakarta
B  selvy    18  Bandung
C   Rita    22   Malang
D   Sony    17    Medan

## Menambahkan Data

In [13]:
## Menambahkan kolom dan data
df['Gaji'] = 20000000
df

    Nama  Usia     Kota      Gaji
A  Rossi    25  Jakarta  20000000
B  selvy    18  Bandung  20000000
C   Rita    22   Malang  20000000
D   Sony    17    Medan  20000000

In [15]:
## Menambahkan kolom dan data
df['Gaji'] = [20000000, 15000000, 10000000, 17000000]
df

    Nama  Usia     Kota      Gaji
A  Rossi    25  Jakarta  20000000
B  selvy    18  Bandung  15000000
C   Rita    22   Malang  10000000
D   Sony    17    Medan  17000000

In [16]:
df['Gaji'] = df['Usia'] * 12000000
df

    Nama  Usia     Kota       Gaji
A  Rossi    25  Jakarta  300000000
B  selvy    18  Bandung  216000000
C   Rita    22   Malang  264000000
D   Sony    17    Medan  204000000

In [ ]:
# Numpy untuk membuat list angka
np.nan = membuat missing value
np.linspace
np.logspace
np.random.randint
np.random.rand
np.random
np.random.randn

In [18]:
df['Gaji'].mean()

246000000.0

In [19]:
df['Gaji'].median()

240000000.0

In [20]:
df['Gaji'].sum()

984000000

In [22]:
df['Gaji'].std()

44362146.02563767

In [23]:
df.describe()   #Pandas

            Usia          Gaji
count   4.000000  4.000000e+00
mean   20.500000  2.460000e+08
std     3.696846  4.436215e+07
min    17.000000  2.040000e+08
25%    17.750000  2.130000e+08
50%    20.000000  2.400000e+08
75%    22.750000  2.730000e+08
max    25.000000  3.000000e+08

In [ ]:
Pandas = std sample
Numpy = std Populasi

In [26]:
data = np.random.randn(5, 4)
data

array([[ 0.64546211, -2.01978363,  0.43513358,  0.79304157],
       [ 0.99454008, -0.65738223,  0.48021257, -0.27526382],
       [ 0.34644593,  0.93395412,  0.66901839, -1.27539305],
       [-0.08346564, -0.34354322,  0.96800386, -1.30983419],
       [-0.69740735,  0.54194658, -0.92656871,  1.08551374]])

In [29]:
df = pd.DataFrame(data, columns = 'W,X,Y,Z'.split(','), index = 'A B C D E'.split(' '))
df

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [32]:
df[['W','Y']]

          W         Y
A  0.645462  0.435134
B  0.994540  0.480213
C  0.346446  0.669018
D -0.083466  0.968004
E -0.697407 -0.926569

In [33]:
df['col_1'] = df['X']*df['Y']
df

          W         X         Y         Z     col_1
A  0.645462 -2.019784  0.435134  0.793042 -0.878876
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683
C  0.346446  0.933954  0.669018 -1.275393  0.624832
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551
E -0.697407  0.541947 -0.926569  1.085514 -0.502151

In [34]:
df['col_2'] = [i ** 2 for i in range (1,6)]
df

          W         X         Y         Z     col_1  col_2
A  0.645462 -2.019784  0.435134  0.793042 -0.878876      1
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683      4
C  0.346446  0.933954  0.669018 -1.275393  0.624832      9
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551     16
E -0.697407  0.541947 -0.926569  1.085514 -0.502151     25

## Menghapus Kolom dan Data

In [35]:
#Perintah drop hanya memperlihatkan saja (tidak mengubah dataframenya)
df

          W         X         Y         Z     col_1  col_2
A  0.645462 -2.019784  0.435134  0.793042 -0.878876      1
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683      4
C  0.346446  0.933954  0.669018 -1.275393  0.624832      9
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551     16
E -0.697407  0.541947 -0.926569  1.085514 -0.502151     25

In [36]:
df.drop('E')

          W         X         Y         Z     col_1  col_2
A  0.645462 -2.019784  0.435134  0.793042 -0.878876      1
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683      4
C  0.346446  0.933954  0.669018 -1.275393  0.624832      9
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551     16

In [37]:
df.drop('E')

          W         X         Y         Z     col_1  col_2
A  0.645462 -2.019784  0.435134  0.793042 -0.878876      1
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683      4
C  0.346446  0.933954  0.669018 -1.275393  0.624832      9
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551     16

In [38]:
df.drop('col_2', axis = 1)

          W         X         Y         Z     col_1
A  0.645462 -2.019784  0.435134  0.793042 -0.878876
B  0.994540 -0.657382  0.480213 -0.275264 -0.315683
C  0.346446  0.933954  0.669018 -1.275393  0.624832
D -0.083466 -0.343543  0.968004 -1.309834 -0.332551
E -0.697407  0.541947 -0.926569  1.085514 -0.502151

In [ ]:
# Secara default nilai axis adalah 0
# Axis 0 = Baris
# Axis 1 = Kolom

In [39]:
df.drop(columns='col_1')

          W         X         Y         Z  col_2
A  0.645462 -2.019784  0.435134  0.793042      1
B  0.994540 -0.657382  0.480213 -0.275264      4
C  0.346446  0.933954  0.669018 -1.275393      9
D -0.083466 -0.343543  0.968004 -1.309834     16
E -0.697407  0.541947 -0.926569  1.085514     25

In [40]:
df.drop(columns=['col_1', 'X'])

          W         Y         Z  col_2
A  0.645462  0.435134  0.793042      1
B  0.994540  0.480213 -0.275264      4
C  0.346446  0.669018 -1.275393      9
D -0.083466  0.968004 -1.309834     16
E -0.697407 -0.926569  1.085514     25

In [1]:
df

NameError: name 'df' is not defined

### Agar Fungsi mengubah Data yang ada
- Assign Nama DataFrame original (variable)
- Gunakan parameter 'inplace = True'

In [ ]:
df = df.drop(columns='col_1')
df

In [52]:
df.drop(columns='col_2', inplace=True)
df

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [49]:
df['X']['B']

-0.6573822256010022

In [48]:
df['X'][['B','C']]

B   -0.657382
C    0.933954
Name: X, dtype: float64

In [50]:
df

          W         X         Y         Z  col_2
A  0.645462 -2.019784  0.435134  0.793042      1
B  0.994540 -0.657382  0.480213 -0.275264      4
C  0.346446  0.933954  0.669018 -1.275393      9
D -0.083466 -0.343543  0.968004 -1.309834     16
E -0.697407  0.541947 -0.926569  1.085514     25

In [53]:
### Mengakses Baris Data

In [54]:
df.loc['C']      # = df.iloc[2]

W    0.346446
X    0.933954
Y    0.669018
Z   -1.275393
Name: C, dtype: float64

In [55]:
df.loc['E']      # = df.iloc[4]

W   -0.697407
X    0.541947
Y   -0.926569
Z    1.085514
Name: E, dtype: float64

In [57]:
# Iloc mengakses data menggunakan index
df.iloc[2]

W    0.346446
X    0.933954
Y    0.669018
Z   -1.275393
Name: C, dtype: float64

In [74]:
df.iloc[1:5]

          W         X         Y         Z
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [75]:
df.iloc[1:5][['X','Y']]

          X         Y
B -0.657382  0.480213
C  0.933954  0.669018
D -0.343543  0.968004
E  0.541947 -0.926569

In [58]:
df.iloc[4]

W   -0.697407
X    0.541947
Y   -0.926569
Z    1.085514
Name: E, dtype: float64

In [59]:
df[['W','X']]

          W         X
A  0.645462 -2.019784
B  0.994540 -0.657382
C  0.346446  0.933954
D -0.083466 -0.343543
E -0.697407  0.541947

In [61]:
df.loc[['C','D']][['W','X']]

          W         X
C  0.346446  0.933954
D -0.083466 -0.343543

In [62]:
df[['Y','Z']].loc[['C','D']]

          Y         Z
C  0.669018 -1.275393
D  0.968004 -1.309834

In [64]:
df[['Y','Z']].loc['C']

Y    0.669018
Z   -1.275393
Name: C, dtype: float64

In [65]:
df['X']['C']

0.9339541166722285

In [66]:
df['X'][['C','D']]

C    0.933954
D   -0.343543
Name: X, dtype: float64

In [67]:
df['X']  #pandas.core.series.Series

A   -2.019784
B   -0.657382
C    0.933954
D   -0.343543
E    0.541947
Name: X, dtype: float64

In [68]:
df[['Y','Z']] #pandas.core.fram.DataFrame

          Y         Z
A  0.435134  0.793042
B  0.480213 -0.275264
C  0.669018 -1.275393
D  0.968004 -1.309834
E -0.926569  1.085514

List = Slicing|
Pandas = Subsetting
### Condditional Subsetting

In [70]:
df

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [69]:
df[df > 0]
#NaN = Not a Number ==> Missing value

          W         X         Y         Z
A  0.645462       NaN  0.435134  0.793042
B  0.994540       NaN  0.480213       NaN
C  0.346446  0.933954  0.669018       NaN
D       NaN       NaN  0.968004       NaN
E       NaN  0.541947       NaN  1.085514

In [71]:
df1 = df[df>0]

In [72]:
df

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [77]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.435134  0.793042
B  0.480213 -0.275264
C  0.669018 -1.275393

In [79]:
df[df['W']>0][['Y','Z']].loc[['B','C']]

          Y         Z
B  0.480213 -0.275264
C  0.669018 -1.275393

In [80]:
df

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [ ]:
# and dan or

In [93]:
df[df['Y']>0]

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834

In [97]:
df[df['W']>0]

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393

In [101]:
df[(df['Y']> 0) & (df['W']> 0)]             #And = &

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393

In [102]:
df[(df['Y']> 0) | (df['W']< 0)]             #Or = |

          W         X         Y         Z
A  0.645462 -2.019784  0.435134  0.793042
B  0.994540 -0.657382  0.480213 -0.275264
C  0.346446  0.933954  0.669018 -1.275393
D -0.083466 -0.343543  0.968004 -1.309834
E -0.697407  0.541947 -0.926569  1.085514

In [104]:
df[(df['Y']> 0) & (df['W']> 0)][['X','Z']].loc[['B','C']]

          X         Z
B -0.657382 -0.275264
C  0.933954 -1.275393

In [105]:
df1

          W         X         Y         Z
A  0.645462       NaN  0.435134  0.793042
B  0.994540       NaN  0.480213       NaN
C  0.346446  0.933954  0.669018       NaN
D       NaN       NaN  0.968004       NaN
E       NaN  0.541947       NaN  1.085514

In [106]:
df1.isna().sum()

W    2
X    3
Y    1
Z    3
dtype: int64

### Technical Approacj Handling Missing Value
- .dropna() ==> Menghapus data yang NaN (Baris)
- .fillna() ==> Membuat/mengisi dengan data sintetis

In [107]:
df1.dropna()

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [112]:
df1.fillna(value = 'Data Kosong')

             W            X            Y            Z
A     0.645462  Data Kosong     0.435134     0.793042
B      0.99454  Data Kosong     0.480213  Data Kosong
C     0.346446     0.933954     0.669018  Data Kosong
D  Data Kosong  Data Kosong     0.968004  Data Kosong
E  Data Kosong     0.541947  Data Kosong      1.08551

In [115]:
df1['W'] = df1['W'].fillna(df1['W'].mean())
df1

          W         X         Y         Z
A  0.645462       NaN  0.435134  0.793042
B  0.994540       NaN  0.480213       NaN
C  0.346446  0.933954  0.669018       NaN
D  0.662149       NaN  0.968004       NaN
E  0.662149  0.541947       NaN  1.085514